Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Inc/simple_text.h
/**
 * @file    simple_text.h
 * @author  Gross
 * @date    05.06.2026
 * @brief   Text rendering on LTDC layers header
 *
 * Usage
 * -----
 * 1. LTDC_Init() + LTDC_ConfigLayer*()	- display setup
 * 2. TEXT_StringBg_draw()              - render string on layer
 */

#ifndef SIMPLE_TEXT_H
#define SIMPLE_TEXT_H

#include <stdint.h>
#include <stddef.h>

#include "stm32n657xx.h"

#include "simple_ltdc.h"

#define TEXT_COLOR_WHITE   0x00FFFFFFU
#define TEXT_COLOR_BLACK   0x00000000U
#define TEXT_COLOR_RED     0x00FF0000U
#define TEXT_COLOR_GREEN   0x0000FF00U
#define TEXT_COLOR_BLUE    0x000000FFU
#define TEXT_COLOR_YELLOW  0x00FFFF00U
#define TEXT_COLOR_CYAN    0x0000FFFFU
#define TEXT_COLOR_MAGENTA 0x00FF00FFU

/**
 * @brief Draw a single character at a given position
 *
 * @param [in] cfg     | Layer configuration
 * @param [in] c       | Character to draw
 * @param [in] x       | X position (top-left)
 * @param [in] y       | Y position (top-left)
 * @param [in] fg_color| Foreground colour in ARGB8888
 */
void TEXT_Char_draw(const LTDC_LayerConfig_TypeDef *cfg, char c, int16_t x, int16_t y, uint32_t fg_color);

/**
 * @brief Draw a null-terminated string
 *
 * @param [in] cfg     | Layer configuration
 * @param [in] str     | String to draw
 * @param [in] x       | Starting X position
 * @param [in] y       | Starting Y position
 * @param [in] fg_color| Foreground colour in ARGB8888
 */
void TEXT_String_draw(const LTDC_LayerConfig_TypeDef *cfg, const char *str, int16_t x, int16_t y, uint32_t fg_color);

/**
 * @brief Draw a string with foreground / background colours
 *
 * @param [in] cfg     | Layer configuration
 * @param [in] str     | String to draw
 * @param [in] x       | Starting X position
 * @param [in] y       | Starting Y position
 * @param [in] fg_color| Foreground colour in ARGB8888
 * @param [in] bg_color| Background colour in ARGB8888
 */
void TEXT_StringBg_draw(const LTDC_LayerConfig_TypeDef *cfg, const char *str, int16_t x, int16_t y, uint32_t fg_color, uint32_t bg_color);

/**
 * @brief Draw a scaled string (nearest-neighbour)
 *
 * @param [in] cfg     | Layer configuration
 * @param [in] str     | String to draw
 * @param [in] x       | Starting X position
 * @param [in] y       | Starting Y position
 * @param [in] fg_color| Foreground colour in ARGB8888
 * @param [in] scale   | Scale factor (0/1 = unscaled, 2+ = scaled)
 */
void TEXT_StringScaled_draw(const LTDC_LayerConfig_TypeDef *cfg, const char *str, int16_t x, int16_t y, uint32_t fg_color, uint8_t scale);

#endif /* SIMPLE_TEXT_H */
